PartialWettingDynamics/zetaStudy/CCA/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh staticFvMesh;
/*
 dynamicFvMesh dynamicRefineFvMesh;
   dynamicRefineFvMeshCoeffs
   {
       refineInterval 400;
       field alpha.water_glycerol;
       lowerRefineLevel 0.0001;
       upperRefineLevel 0.9999;
       unrefineLevel 10;
       nBufferLayers 1;
       maxRefinement 1;
       maxCells 1500000;
       correctFluxes (( phi U) (nHatf none) (rhoPhi none) (ghf none) (alphaPhi_ none) (nHatf_ none) (Kf_ none) (dVf_ none) (deltaFunction_ none) );
       dumpLevel true;
   }
*/

// ************************************************************************* //
