PartialWettingDynamics/zetaStudy/CCA/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    left
    {
        type            zeroGradient;
    }

    right
    {
        type           zeroGradient;
    }
    front 
    {
        type            zeroGradient;
    }

    back
    {
	    type	zeroGradient;
    }

    top
    {
        type          zeroGradient; 
    }
   bottom 
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    /*phyllic
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }*/


}

// ************************************************************************* //


